platformio/platform-atmelavr/misc/svd/atmega644.svd
<device>
  <vendor>Atmel</vendor>
  <name>ATmega644</name>
  <addressUnitBits>8</addressUnitBits>
  <size>8</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0xff</resetMask>
  <peripherals>
    <peripheral>
      <name>AC</name>
      <description>Analog Comparator</description>
      <baseAddress>0x50</baseAddress>
      <registers>
        <register>
          <name>ACSR</name>
          <description>Analog Comparator Control And Status Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ACIS</name>
              <description>Analog Comparator Interrupt Mode Select</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ACIS</name><usage>read-write</usage><enumeratedValue><name>ON_TOGGLE</name><description>Interrupt on Toggle</description><value>0</value></enumeratedValue><enumeratedValue><name>ON_FALLING_EDGE</name><description>Interrupt on Falling Edge</description><value>2</value></enumeratedValue><enumeratedValue><name>ON_RISING_EDGE</name><description>Interrupt on Rising Edge</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ACIC</name>
              <description>Analog Comparator Input Capture Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACIE</name>
              <description>Analog Comparator Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACI</name>
              <description>Analog Comparator Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACO</name>
              <description>Analog Compare Output</description>
              <bitRange>[5:5]</bitRange>
            <access>read-only</access></field>
            <field>
              <name>ACBG</name>
              <description>Analog Comparator Bandgap Select</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ACD</name>
              <description>Analog Comparator Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>ADC Control and Status Register B</description>
          <addressOffset>0x2B</addressOffset>
          <fields>
            <field>
              <name>ACME</name>
              <description>Analog Comparator Multiplexer Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR1</name>
          <description>Digital Input Disable Register 1</description>
          <addressOffset>0x2F</addressOffset>
          <fields>
            <field>
              <name>AIN0D</name>
              <description>AIN0 Digital Input Disable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AIN1D</name>
              <description>AIN1 Digital Input Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>Analog-to-Digital Converter</description>
      <baseAddress>0x78</baseAddress>
      <registers>
        <register>
          <name>ADC</name>
          <description>ADC Data Register  Bytes</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>ADCSRA</name>
          <description>The ADC Control and Status register A</description>
          <addressOffset>0x2</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADPS</name>
              <description>ADC  Prescaler Select Bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>ADPS</name><usage>read-write</usage><enumeratedValue><name>PRESCALER_2</name><description>Prescaler Value 2</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALER_4</name><description>Prescaler Value 4</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALER_8</name><description>Prescaler Value 8</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALER_16</name><description>Prescaler Value 16</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALER_32</name><description>Prescaler Value 32</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALER_64</name><description>Prescaler Value 64</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALER_128</name><description>Prescaler Value 128</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>ADIE</name>
              <description>ADC Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADIF</name>
              <description>ADC Interrupt Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADATE</name>
              <description>ADC  Auto Trigger Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADSC</name>
              <description>ADC Start Conversion</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADEN</name>
              <description>ADC Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSRB</name>
          <description>The ADC Control and Status register B</description>
          <addressOffset>0x3</addressOffset>
          <fields>
            <field>
              <name>ADTS</name>
              <description>ADC Auto Trigger Source bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Free Running mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Analog Comparator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>External Interrupt Request 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Timer/Counter0 Compare Match A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Timer/Counter0 Overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Timer/Counter1 Compare Match B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>Timer/Counter1 Overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>Timer/Counter1 Capture Event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACME</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMUX</name>
          <description>The ADC multiplexer Selection Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>MUX</name>
              <description>Analog Channel and Gain Selection Bits</description>
              <bitRange>[4:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC0</name>
                  <description>ADC Single Ended Input pin 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1</name>
                  <description>ADC Single Ended Input pin 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2</name>
                  <description>ADC Single Ended Input pin 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3</name>
                  <description>ADC Single Ended Input pin 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC4</name>
                  <description>ADC Single Ended Input pin 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC5</name>
                  <description>ADC Single Ended Input pin 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC6</name>
                  <description>ADC Single Ended Input pin 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC7</name>
                  <description>ADC Single Ended Input pin 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC0_10X</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 0 10x Gain</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC0_10X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 0 10x Gain</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC0_200x</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 0 200x Gain</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC0_200X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 0 200x Gain</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC2_10X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 2 10x Gain</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC2_10X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 2 10x Gain</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC2_200X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 2 200x Gain</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC2_200X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 2 200x Gain</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 1 1x Gain</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 1 1x Gain</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 1 1x Gain</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 1 1x Gain</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC4_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 4 Negative pin 1 1x Gain</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC5_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 5 Negative pin 1 1x Gain</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC6_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 6 Negative pin 1 1x Gain</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC7_ADC1_1X</name>
                  <description>ADC Differential Inputs Postive pin 7 Negative pin 1 1x Gain</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 0 Negative pin 2 1x Gain</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC1_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 1 Negative pin 2 1x Gain</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC2_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 2 Negative pin 2 1x Gain</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC3_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 3 Negative pin 2 1x Gain</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC4_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 4 Negative pin 2 1x Gain</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC5_ADC2_1X</name>
                  <description>ADC Differential Inputs Postive pin 5 Negative pin 2 1x Gain</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_VBG</name>
                  <description>Internal Reference (VBG)</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_GND</name>
                  <description>0V (GND)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADLAR</name>
              <description>Left Adjust Result</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>REFS</name>
              <description>Reference Selection Bits</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>REFS</name><usage>read-write</usage><enumeratedValue><name>AREF</name><description>Aref Internal Vref turned off</description><value>0</value></enumeratedValue><enumeratedValue><name>AVCC</name><description>AVcc with external capacitor at AREF pin</description><value>1</value></enumeratedValue><enumeratedValue><name>INTERNAL</name><description>Internal 1.1V Voltage Reference with external capacitor at AREF pin</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIDR0</name>
          <description>Digital Input Disable Register</description>
          <addressOffset>0x6</addressOffset>
          <fields>
            <field>
              <name>ADC0D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC1D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC2D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC3D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADC4D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC5D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADC6D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC7D</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
