platformio/platform-atmelavr/misc/svd/atmega644.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BOOT_LOAD</name>
      <description>Bootloader</description>
      <baseAddress>0x57</baseAddress>
      <registers>
        <register>
          <name>SPMCSR</name>
          <description>Store Program Memory Control Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SPMEN</name>
              <description>Store Program Memory Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PGERS</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PGWRT</name>
              <description>Page Write</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BLBSET</name>
              <description>Boot Lock Bit Set</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RWWSRE</name>
              <description>Read While Write section read enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SIGRD</name>
              <description>Signature Row Read</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RWWSB</name>
              <description>Read While Write Section Busy</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SPMIE</name>
              <description>SPM Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU Registers</description>
      <baseAddress>0x3E</baseAddress>
      <interrupt>
        <name>RESET</name>
        <description>External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     </description>
      <value>0</value>
        </interrupt>
      <interrupt>
        <name>INT0</name>
        <description>External Interrupt Request 0</description>
      <value>1</value>
        </interrupt>
      <interrupt>
        <name>INT1</name>
        <description>External Interrupt Request 1</description>
      <value>2</value>
        </interrupt>
      <interrupt>
        <name>INT2</name>
        <description>External Interrupt Request 2</description>
      <value>3</value>
        </interrupt>
      <interrupt>
        <name>PCINT0</name>
        <description>Pin Change Interrupt Request 0</description>
      <value>4</value>
        </interrupt>
      <interrupt>
        <name>PCINT1</name>
        <description>Pin Change Interrupt Request 1</description>
      <value>5</value>
        </interrupt>
      <interrupt>
        <name>PCINT2</name>
        <description>Pin Change Interrupt Request 2</description>
      <value>6</value>
        </interrupt>
      <interrupt>
        <name>PCINT3</name>
        <description>Pin Change Interrupt Request 3</description>
      <value>7</value>
        </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>Watchdog Time-out Interrupt</description>
      <value>8</value>
        </interrupt>
      <interrupt>
        <name>TIMER2_COMPA</name>
        <description>Timer/Counter2 Compare Match A</description>
      <value>9</value>
        </interrupt>
      <interrupt>
        <name>TIMER2_COMPB</name>
        <description>Timer/Counter2 Compare Match B</description>
      <value>10</value>
        </interrupt>
      <interrupt>
        <name>TIMER2_OVF</name>
        <description>Timer/Counter2 Overflow</description>
      <value>11</value>
        </interrupt>
      <interrupt>
        <name>TIMER1_CAPT</name>
        <description>Timer/Counter1 Capture Event</description>
      <value>12</value>
        </interrupt>
      <interrupt>
        <name>TIMER1_COMPA</name>
        <description>Timer/Counter1 Compare Match A</description>
      <value>13</value>
        </interrupt>
      <interrupt>
        <name>TIMER1_COMPB</name>
        <description>Timer/Counter1 Compare Match B</description>
      <value>14</value>
        </interrupt>
      <interrupt>
        <name>TIMER1_OVF</name>
        <description>Timer/Counter1 Overflow</description>
      <value>15</value>
        </interrupt>
      <interrupt>
        <name>TIMER0_COMPA</name>
        <description>Timer/Counter0 Compare Match A</description>
      <value>16</value>
        </interrupt>
      <interrupt>
        <name>TIMER0_COMPB</name>
        <description>Timer/Counter0 Compare Match B</description>
      <value>17</value>
        </interrupt>
      <interrupt>
        <name>TIMER0_OVF</name>
        <description>Timer/Counter0 Overflow</description>
      <value>18</value>
        </interrupt>
      <interrupt>
        <name>SPI_STC</name>
        <description>SPI Serial Transfer Complete</description>
      <value>19</value>
        </interrupt>
      <interrupt>
        <name>USART0_RX</name>
        <description>USART0, Rx Complete</description>
      <value>20</value>
        </interrupt>
      <interrupt>
        <name>USART0_UDRE</name>
        <description>USART0 Data register Empty</description>
      <value>21</value>
        </interrupt>
      <interrupt>
        <name>USART0_TX</name>
        <description>USART0, Tx Complete</description>
      <value>22</value>
        </interrupt>
      <interrupt>
        <name>ANALOG_COMP</name>
        <description>Analog Comparator</description>
      <value>23</value>
        </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>ADC Conversion Complete</description>
      <value>24</value>
        </interrupt>
      <interrupt>
        <name>EE_READY</name>
        <description>EEPROM Ready</description>
      <value>25</value>
        </interrupt>
      <interrupt>
        <name>TWI</name>
        <description>2-wire Serial Interface</description>
      <value>26</value>
        </interrupt>
      <interrupt>
        <name>SPM_READY</name>
        <description>Store Program Memory Read</description>
      <value>27</value>
        </interrupt>
    <registers>
        <register>
          <name>CLKPR</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x23</addressOffset>
          <fields>
            <field>
              <name>CLKPS</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x06</name>
                  <description>64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x07</name>
                  <description>128</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x08</name>
                  <description>256</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKPCE</name>
              <description>&lt;TBD&gt;</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR0</name>
          <description>General Purpose IO Register 0</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>GPIOR00</name>
              <description>General Purpose IO Register 0 bit 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOR01</name>
              <description>General Purpose IO Register 0 bit 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOR02</name>
              <description>General Purpose IO Register 0 bit 2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIOR03</name>
              <description>General Purpose IO Register 0 bit 3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>GPIOR04</name>
              <description>General Purpose IO Register 0 bit 4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>GPIOR05</name>
              <description>General Purpose IO Register 0 bit 5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>GPIOR06</name>
              <description>General Purpose IO Register 0 bit 6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GPIOR07</name>
              <description>General Purpose IO Register 0 bit 7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR1</name>
          <description>General Purpose IO Register 1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>GPIOR</name>
              <description>General Purpose IO Register 1 bis</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOR2</name>
          <description>General Purpose IO Register 2</description>
          <addressOffset>0xD</addressOffset>
          <fields>
            <field>
              <name>GPIOR</name>
              <description>General Purpose IO Register 2 bis</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x17</addressOffset>
          <fields>
            <field>
              <name>IVCE</name>
              <description>Interrupt Vector Change Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PUD</name>
              <description>Pull-up disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register</description>
          <addressOffset>0x16</addressOffset>
          <fields>
            <field>
              <name>PORF</name>
              <description>Power-on reset flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EXTRF</name>
              <description>External Reset Flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BORF</name>
              <description>Brown-out Reset Flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WDRF</name>
              <description>Watchdog Reset Flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCAL</name>
          <description>Oscillator Calibration Value</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>OSCCAL</name>
              <description>Oscillator Calibration </description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PRR</name>
          <description>Power Reduction Register</description>
          <addressOffset>0x26</addressOffset>
          <fields>
            <field>
              <name>PRADC</name>
              <description>Power Reduction ADC</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PRUSART0</name>
              <description>Power Reduction USART</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PRSPI</name>
              <description>Power Reduction Serial Peripheral Interface</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PRTIM1</name>
              <description>Power Reduction Timer/Counter1</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PRTIM0</name>
              <description>Power Reduction Timer/Counter0</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PRTIM2</name>
              <description>Power Reduction Timer/Counter2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PRTWI</name>
              <description>Power Reduction TWI</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>Sleep Mode Control Register</description>
          <addressOffset>0x15</addressOffset>
          <fields>
            <field>
              <name>SE</name>
              <description>Sleep Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SM</name>
              <description>Sleep Mode Select bits</description>
              <bitRange>[3:1]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>ADC Noise Reduction (If Available)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDOWN</name>
                  <description>Power Down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSAVE</name>
                  <description>Power Save</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x04</name>
                  <description>Reserved</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x05</name>
                  <description>Reserved</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STDBY</name>
                  <description>Standby</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ESTDBY</name>
                  <description>Extended Standby</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
