platformio/platform-atmelavr/misc/svd/atmega644.svd
      </registers>
      </peripheral>
    <peripheral>
      <name>EEPROM</name>
      <description>EEPROM</description>
      <baseAddress>0x3F</baseAddress>
      <registers>
        <register>
          <name>EEAR</name>
          <description>EEPROM Address Register Low Bytes</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>EECR</name>
          <description>EEPROM Control Register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EERE</name>
              <description>EEPROM Read Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EEPE</name>
              <description>EEPROM Write Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EEMPE</name>
              <description>EEPROM Master Write Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EERIE</name>
              <description>EEPROM Ready Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EEPM</name>
              <description>EEPROM Programming Mode Bits</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Erase and Write in one operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Erase Only</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Write Only</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EEDR</name>
          <description>EEPROM Data Register</description>
          <addressOffset>0x1</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>EXINT</name>
      <description>External Interrupts</description>
      <baseAddress>0x3B</baseAddress>
      <registers>
        <register>
          <name>EICRA</name>
          <description>External Interrupt Control Register A</description>
          <addressOffset>0x2E</addressOffset>
          <fields>
            <field>
              <name>ISC0</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC1</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISC2</name>
              <description>External Interrupt Sense Control Bit</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VAL_0x00</name>
                  <description>Low Level of INTX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x01</name>
                  <description>Any Logical Change of INTX</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x02</name>
                  <description>Falling Edge of INTX</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VAL_0x03</name>
                  <description>Rising Edge of INTX</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EIFR</name>
          <description>External Interrupt Flag Register</description>
          <addressOffset>0x1</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>INTF</name>
              <description>External Interrupt Flags</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>EIMSK</name>
          <description>External Interrupt Mask Register</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>INT</name>
              <description>External Interrupt Request 2 Enable</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCICR</name>
          <description>Pin Change Interrupt Control Register</description>
          <addressOffset>0x2D</addressOffset>
          <fields>
            <field>
              <name>PCIE</name>
              <description>Pin Change Interrupt Enables</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCIFR</name>
          <description>Pin Change Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>PCIF</name>
              <description>Pin Change Interrupt Flags</description>
              <bitRange>[3:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK0</name>
          <description>Pin Change Mask Register 0</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK1</name>
          <description>Pin Change Mask Register 1</description>
          <addressOffset>0x31</addressOffset>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK2</name>
          <description>Pin Change Mask Register 2</description>
          <addressOffset>0x32</addressOffset>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PCMSK3</name>
          <description>Pin Change Mask Register 3</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PCINT</name>
              <description>Pin Change Enable Masks</description>
              <bitRange>[7:0]</bitRange>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
