platformio/platform-atmelavr/misc/svd/atmega644.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JTAG</name>
      <description>JTAG Interface</description>
      <baseAddress>0x51</baseAddress>
      <registers>
        <register>
          <name>MCUCR</name>
          <description>MCU Control Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>JTD</name>
              <description>JTAG Interface Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSR</name>
          <description>MCU Status Register</description>
          <addressOffset>0x3</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>JTRF</name>
              <description>JTAG Reset Flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OCDR</name>
          <description>On-Chip Debug Related Register in I/O Memory</description>
          <addressOffset>0x0</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LOCKBIT</name>
      <description>Lockbits</description>
      <baseAddress>0x0</baseAddress>
      <registers>
        <register>
          <name>LOCKBIT</name>
          <description>&lt;TBD&gt;</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LB</name>
              <description>Memory Lock</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROG_VER_DISABLED</name>
                  <description>Further programming and verification disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROG_DISABLED</name>
                  <description>Further programming disabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No memory lock features enabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLB0</name>
              <description>Boot Loader Protection Mode</description>
              <bitRange>[3:2]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_SPM_DISABLE</name>
                  <description>LPM and SPM prohibited in Application Section</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DISABLE</name>
                  <description>LPM prohibited in Application Section</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPM_DISABLE</name>
                  <description>SPM prohibited in Application Section</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No lock on SPM and LPM in Application Section</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLB1</name>
              <description>Boot Loader Protection Mode</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPM_SPM_DISABLE</name>
                  <description>LPM and SPM prohibited in Boot Section</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM_DISABLE</name>
                  <description>LPM prohibited in Boot Section</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPM_DISABLE</name>
                  <description>SPM prohibited in Boot Section</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_LOCK</name>
                  <description>No lock on SPM and LPM in Boot Section</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTA</name>
      <description>I/O Port</description>
      <baseAddress>0x20</baseAddress>
      <registers>
        <register>
          <name>DDRA</name>
          <description>Port A Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>PA0</name>
              <description>Pin A0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PA1</name>
              <description>Pin A1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PA2</name>
              <description>Pin A2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PA3</name>
              <description>Pin A3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PA4</name>
              <description>Pin A4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PA5</name>
              <description>Pin A5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PA6</name>
              <description>Pin A6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PA7</name>
              <description>Pin A7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PINA</name>
          <description>Port A Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PA0</name>
              <description>Pin A0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PA1</name>
              <description>Pin A1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PA2</name>
              <description>Pin A2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PA3</name>
              <description>Pin A3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PA4</name>
              <description>Pin A4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PA5</name>
              <description>Pin A5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PA6</name>
              <description>Pin A6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PA7</name>
              <description>Pin A7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTA</name>
          <description>Port A Data Register</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PA0</name>
              <description>Pin A0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PA1</name>
              <description>Pin A1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PA2</name>
              <description>Pin A2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PA3</name>
              <description>Pin A3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PA4</name>
              <description>Pin A4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PA5</name>
              <description>Pin A5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PA6</name>
              <description>Pin A6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PA7</name>
              <description>Pin A7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
