platformio/platform-atmelavr/misc/svd/atmega644.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTB</name>
      <description>I/O Port</description>
      <baseAddress>0x23</baseAddress>
      <registers>
        <register>
          <name>DDRB</name>
          <description>Port B Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin B4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin B5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin B6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin B7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PINB</name>
          <description>Port B Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin B4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin B5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin B6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin B7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTB</name>
          <description>Port B Data Register</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PB0</name>
              <description>Pin B0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PB1</name>
              <description>Pin B1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PB2</name>
              <description>Pin B2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PB3</name>
              <description>Pin B3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PB4</name>
              <description>Pin B4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PB5</name>
              <description>Pin B5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PB6</name>
              <description>Pin B6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PB7</name>
              <description>Pin B7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTC</name>
      <description>I/O Port</description>
      <baseAddress>0x26</baseAddress>
      <registers>
        <register>
          <name>DDRC</name>
          <description>Port C Data Direction Register</description>
          <addressOffset>0x1</addressOffset>
          <fields>
            <field>
              <name>PC0</name>
              <description>Pin C0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PC1</name>
              <description>Pin C1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PC2</name>
              <description>Pin C2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PC3</name>
              <description>Pin C3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PC4</name>
              <description>Pin C4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PC5</name>
              <description>Pin C5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PC6</name>
              <description>Pin C6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PC7</name>
              <description>Pin C7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PINC</name>
          <description>Port C Input Pins</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PC0</name>
              <description>Pin C0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PC1</name>
              <description>Pin C1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PC2</name>
              <description>Pin C2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PC3</name>
              <description>Pin C3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PC4</name>
              <description>Pin C4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PC5</name>
              <description>Pin C5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PC6</name>
              <description>Pin C6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PC7</name>
              <description>Pin C7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTC</name>
          <description>Port C Data Register</description>
          <addressOffset>0x2</addressOffset>
          <fields>
            <field>
              <name>PC0</name>
              <description>Pin C0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PC1</name>
              <description>Pin C1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PC2</name>
              <description>Pin C2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PC3</name>
              <description>Pin C3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PC4</name>
              <description>Pin C4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PC5</name>
              <description>Pin C5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PC6</name>
              <description>Pin C6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PC7</name>
              <description>Pin C7</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
