platformio/platform-atmelavr/misc/svd/atmega644.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC0</name>
      <description>Timer/Counter, 8-bit</description>
      <baseAddress>0x35</baseAddress>
      <registers>
        <register>
          <name>GTCCR</name>
          <description>General Timer/Counter Control Register</description>
          <addressOffset>0xE</addressOffset>
          <fields>
            <field>
              <name>PSRSYNC</name>
              <description>Prescaler Reset Timer/Counter1 and Timer/Counter0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR0A</name>
          <description>Timer/Counter0 Output Compare Register</description>
          <addressOffset>0x12</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR0B</name>
          <description>Timer/Counter0 Output Compare Register</description>
          <addressOffset>0x13</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR0A</name>
          <description>Timer/Counter  Control Register A</description>
          <addressOffset>0xF</addressOffset>
          <fields>
            <field>
              <name>WGM0</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>WGM0</name><usage>read-write</usage><enumeratedValue><name>NORMAL_TOP</name><description>Normal, Top: `0xff`, Update: *Immediate*, Flag: *MAX*</description><value>0</value></enumeratedValue><enumeratedValue><name>PWM_PHASE</name><description>Phase Correct PWM, Top: `0xff`, Update: *TOP*, Flag: *BOTTOM*</description><value>1</value></enumeratedValue><enumeratedValue><name>CTC</name><description>CTC, Top: *OCRA*, Update: *Immediate*, Flag: *MAX*</description><value>2</value></enumeratedValue><enumeratedValue><name>PWM_FAST</name><description>Fast PWM, Top: `0xff`, Update: *TOP*, Flag: *MAX*</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM0B</name>
              <description>Compare Output B Mode</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>COM0B</name><usage>read-write</usage><enumeratedValue><name>DISCONNECTED</name><description>Normal port operation, OCix disconnected</description><value>0</value></enumeratedValue><enumeratedValue><name>MATCH_TOGGLE</name><description>Toggle OCix on Compare Match (Might depend on WGM)</description><value>1</value></enumeratedValue><enumeratedValue><name>MATCH_CLEAR</name><description>Clear OCix on Compare Match (If PWM is enabled, OCix is set at TOP)</description><value>2</value></enumeratedValue><enumeratedValue><name>MATCH_SET</name><description>Set OCix on Compare Match (If PWM is enabled, OCix is cleared at TOP)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM0A</name>
              <description>Compare Output A Mode</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues derivedFrom="COM0B" />
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR0B</name>
          <description>Timer/Counter Control Register B</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CS0</name>
              <description>Clock Select</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>CS0</name><usage>read-write</usage><enumeratedValue><name>NO_CLOCK</name><description>No clock source (Timer/Counter stopped)</description><value>0</value></enumeratedValue><enumeratedValue><name>DIRECT</name><description>Running, No Prescaling</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALE_8</name><description>Running, CLK/8</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALE_64</name><description>Running, CLK/64</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALE_256</name><description>Running, CLK/256</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALE_1024</name><description>Running, CLK/1024</description><value>5</value></enumeratedValue><enumeratedValue><name>EXT_FALLING</name><description>Running, ExtClk Tx Falling Edge</description><value>6</value></enumeratedValue><enumeratedValue><name>EXT_RISING</name><description>Running, ExtClk Tx Rising Edge</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WGM02</name>
              <description>Waveform Generation Mode High Bit (Enable Top: *OCRA* for `PWM` modes)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FOC0B</name>
              <description>Force Output Compare B</description>
              <bitRange>[6:6]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>FOC0A</name>
              <description>Force Output Compare A</description>
              <bitRange>[7:7]</bitRange>
            <access>write-only</access></field>
          </fields>
        </register>
        <register>
          <name>TCNT0</name>
          <description>Timer/Counter0</description>
          <addressOffset>0x11</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR0</name>
          <description>Timer/Counter0 Interrupt Flag register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV0</name>
              <description>Timer/Counter0 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OCF0A</name>
              <description>Timer/Counter0 Output Compare Flag 0A</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCF0B</name>
              <description>Timer/Counter0 Output Compare Flag 0B</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK0</name>
          <description>Timer/Counter0 Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <fields>
            <field>
              <name>TOIE0</name>
              <description>Timer/Counter0 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OCIE0A</name>
              <description>Timer/Counter0 Output Compare Match A Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCIE0B</name>
              <description>Timer/Counter0 Output Compare Match B Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
