platformio/platform-atmelavr/misc/svd/atmega644.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC2</name>
      <description>Timer/Counter, 8-bit Async</description>
      <baseAddress>0x37</baseAddress>
      <registers>
        <register>
          <name>ASSR</name>
          <description>Asynchronous Status Register</description>
          <addressOffset>0x7F</addressOffset>
          <fields>
            <field>
              <name>TCR2BUB</name>
              <description>Timer/Counter Control Register2 Update Busy</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCR2AUB</name>
              <description>Timer/Counter Control Register2 Update Busy</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCR2BUB</name>
              <description>Output Compare Register 2 Update Busy</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OCR2AUB</name>
              <description>Output Compare Register2 Update Busy</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCN2UB</name>
              <description>Timer/Counter2 Update Busy</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AS2</name>
              <description>Asynchronous Timer/Counter2</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EXCLK</name>
              <description>Enable External Clock Input</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GTCCR</name>
          <description>General Timer Counter Control register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PSRASY</name>
              <description>Prescaler Reset Timer/Counter2</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR2A</name>
          <description>Timer/Counter2 Output Compare Register A</description>
          <addressOffset>0x7C</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>OCR2B</name>
          <description>Timer/Counter2 Output Compare Register B</description>
          <addressOffset>0x7D</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TCCR2A</name>
          <description>Timer/Counter2 Control Register A</description>
          <addressOffset>0x79</addressOffset>
          <fields>
            <field>
              <name>WGM2</name>
              <description>Waveform Genration Mode</description>
              <bitRange>[1:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>WGM2</name><usage>read-write</usage><enumeratedValue><name>NORMAL_TOP</name><description>Normal, Top: `0xff`, Update: *Immediate*, Flag: *MAX*</description><value>0</value></enumeratedValue><enumeratedValue><name>PWM_PHASE</name><description>Phase Correct PWM, Top: `0xff`, Update: *TOP*, Flag: *BOTTOM*</description><value>1</value></enumeratedValue><enumeratedValue><name>CTC</name><description>CTC, Top: *OCRA*, Update: *Immediate*, Flag: *MAX*</description><value>2</value></enumeratedValue><enumeratedValue><name>PWM_FAST</name><description>Fast PWM, Top: `0xff`, Update: *TOP*, Flag: *MAX*</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM2B</name>
              <description>Compare Output B Mode</description>
              <bitRange>[5:4]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues><name>COM2B</name><usage>read-write</usage><enumeratedValue><name>DISCONNECTED</name><description>Normal port operation, OCix disconnected</description><value>0</value></enumeratedValue><enumeratedValue><name>MATCH_TOGGLE</name><description>Toggle OCix on Compare Match (Might depend on WGM)</description><value>1</value></enumeratedValue><enumeratedValue><name>MATCH_CLEAR</name><description>Clear OCix on Compare Match (If PWM is enabled, OCix is set at TOP)</description><value>2</value></enumeratedValue><enumeratedValue><name>MATCH_SET</name><description>Set OCix on Compare Match (If PWM is enabled, OCix is cleared at TOP)</description><value>3</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>COM2A</name>
              <description>Compare Output A Mode</description>
              <bitRange>[7:6]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
            <enumeratedValues derivedFrom="COM2B" />
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR2B</name>
          <description>Timer/Counter2 Control Register B</description>
          <addressOffset>0x7A</addressOffset>
          <fields>
            <field>
              <name>CS2</name>
              <description>Clock Select bits</description>
              <bitRange>[2:0]</bitRange>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues><name>CS2</name><usage>read-write</usage><enumeratedValue><name>NO_CLOCK</name><description>No clock source (Timer/Counter stopped)</description><value>0</value></enumeratedValue><enumeratedValue><name>DIRECT</name><description>Running, No Prescaling</description><value>1</value></enumeratedValue><enumeratedValue><name>PRESCALE_8</name><description>Running, CLK/8</description><value>2</value></enumeratedValue><enumeratedValue><name>PRESCALE_32</name><description>Running, CLK/32</description><value>3</value></enumeratedValue><enumeratedValue><name>PRESCALE_64</name><description>Running, CLK/64</description><value>4</value></enumeratedValue><enumeratedValue><name>PRESCALE_128</name><description>Running, CLK/128</description><value>5</value></enumeratedValue><enumeratedValue><name>PRESCALE_256</name><description>Running, CLK/256</description><value>6</value></enumeratedValue><enumeratedValue><name>PRESCALE_1024</name><description>Running, CLK/1024</description><value>7</value></enumeratedValue></enumeratedValues>
            </field>
            <field>
              <name>WGM22</name>
              <description>Waveform Generation Mode High Bit (Enable Top: *OCRA* for `PWM` modes)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FOC2B</name>
              <description>Force Output Compare B</description>
              <bitRange>[6:6]</bitRange>
            <access>write-only</access></field>
            <field>
              <name>FOC2A</name>
              <description>Force Output Compare A</description>
              <bitRange>[7:7]</bitRange>
            <access>write-only</access></field>
          </fields>
        </register>
        <register>
          <name>TCNT2</name>
          <description>Timer/Counter2</description>
          <addressOffset>0x7B</addressOffset>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>TIFR2</name>
          <description>Timer/Counter Interrupt Flag Register</description>
          <addressOffset>0x0</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV2</name>
              <description>Timer/Counter2 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OCF2A</name>
              <description>Output Compare Flag 2A</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCF2B</name>
              <description>Output Compare Flag 2B</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK2</name>
          <description>Timer/Counter Interrupt Mask register</description>
          <addressOffset>0x39</addressOffset>
          <fields>
            <field>
              <name>TOIE2</name>
              <description>Timer/Counter2 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OCIE2A</name>
              <description>Timer/Counter2 Output Compare Match A Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OCIE2B</name>
              <description>Timer/Counter2 Output Compare Match B Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
